Revit 2027 API
ParameterFilterElement.GetElementFilterParametersForCategory Method
 Retrieves a list of the parameters associated with all rules in the filter that are combined (using logical AND) with a FilterCategoryRule corresponding to single %categoryId%.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetElementFilterParametersForCategory(
	ElementId categoryId
)
Public Function GetElementFilterParametersForCategory (
	categoryId As ElementId
) As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetElementFilterParametersForCategory(
	ElementId^ categoryId
)
member GetElementFilterParametersForCategory :
        categoryId : ElementId -> ISet<ElementId>
Parameters
categoryId ElementId
 The category for which parameters should be found.
Return Value
ISet<ElementId>
 A set of parameter identifiers.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Note that in the case when InvalidElementId specified as input %categoryId% this function returns parameters common to all categories used by this ParameterFilterElement, i.e. it is equivalent to ParameterFilterElement.GetElementFilterParameters().
See Also
Reference
ParameterFilterElement Class
Autodesk.Revit.DB Namespace